In [1]:
import pandas as pd
import numpy as np
import os

In [5]:
df = pd.read_csv(os.path.join(os.getcwd(), 'Data\Salaries.csv'))
df

C:\Users\harsh\AppData\Local\Temp\ipykernel_13712\730685491.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(os.path.join(os.getcwd(), 'Data\Salaries.csv'))

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

## Question 1: Find the number of rows and columns in the dataset.

In [3]:
print('Total number of rows: ', len(df))
print('Total number of columns: ', len(df.columns))

Total number of rows:  148654
Total number of columns:  13

## Question 2: Get the information about the dataset like total number of rows, data types of each columns and memory requirement.

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

## Question 3: Check null values in the dataset.

In [5]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

## Question 4: Drop ID, Notes, Agency and Status columns.

In [6]:
df.drop(columns=['Id', 'Notes', 'Agency', 'Status'], axis=1, inplace=True)

## Question 5: Get overall statistics about the dataset.

In [7]:
df.describe(include= 'all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

## Question 6: Find occurence of the employee name (Top 5).

In [8]:
df['EmployeeName'].value_counts().head()

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: EmployeeName, dtype: int64

## Question 7: Find the number of unique job titles.

In [9]:
df['JobTitle'].nunique()

2159

## Question 8: Find the number of job titles contains 'Captain'.

In [10]:
len(df[df['JobTitle'].str.contains('Captain',case = False)])

552

## Question 9: Display all the employees from the fire department.

In [11]:
df[df['JobTitle'].str.contains('Fire', case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

## Question 10: Find the minimum, maximum and average Base Pay.

In [12]:
df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')

print('The minimum base pay is: ', df['BasePay'].min())
print('The maximum base pay is: ', df['BasePay'].max())
print('The average base pay is: ', round(df['BasePay'].mean(),2))

The minimum base pay is:  -166.01
The maximum base pay is:  319275.01
The average base pay is:  66325.45

## Question 11: Replace 'Not provided' in EmployeeName to NaN.

In [13]:
df['EmployeeName'] = df['EmployeeName'].replace('Not provided', np.nan)
df['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

## Question 12: Find the job title of ALBERT PARDINI.

In [14]:
emp_name = 'ALBERT PARDINI'
print('The job title of', emp_name, 'is:', df[df['EmployeeName']==emp_name]['JobTitle'].values[0])

The job title of ALBERT PARDINI is: CAPTAIN III (POLICE DEPARTMENT)

## Question 13: How much ALBERT PARDINI make (including benefits)?

In [15]:
print('Total pay including benefits for',emp_name,':',df[df['EmployeeName']=='ALBERT PARDINI']['TotalPayBenefits'].values[0])

Total pay including benefits for ALBERT PARDINI : 335279.91

## Question 14: Display name of the person having the highest Base Pay.

In [16]:
print('Employee name with the highest base pay:',df[df['BasePay'].max()==df['BasePay']]['EmployeeName'].values[0])

Employee name with the highest base pay: Gregory P Suhr

## Question 15: Find average base pay of all the employees per year.

In [17]:
df.groupby('Year')['BasePay'].mean().round(2)

Year
2011    63595.96
2012    65436.41
2013    69630.03
2014    66564.42
Name: BasePay, dtype: float64

## Question 16: Find average base pay of all the employess per job title.

In [18]:
df.groupby('JobTitle')['BasePay'].mean().round(2)

JobTitle
ACCOUNT CLERK                                     43300.81
ACCOUNTANT                                        46643.17
ACCOUNTANT INTERN                                 28732.66
ACPO,JuvP, Juv Prob (SFERS)                       62290.78
ACUPUNCTURIST                                     66374.40
                                                    ...
X-RAY LABORATORY AIDE                             47664.77
X-Ray Laboratory Aide                             46086.39
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.91
Youth Comm Advisor                                39077.96
ZOO CURATOR                                       43148.00
Name: BasePay, Length: 2159, dtype: float64

## Question 17: Find average base pay of employees having job title accountant.

In [19]:
df[df['JobTitle']== 'ACCOUNTANT']['BasePay'].mean().round(2)

46643.17

## Question 18: Find Top 5 most coommon jobs

In [20]:
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64